In [20]:
import pandas as pd

In [21]:
tb1=pd.read_excel(r"C:\Users\Lucky Prem\Downloads\organizations-100\sample_-_superstore.xls", sheet_name="People")

In [25]:
tb1

              Person   Region Sex  Age
0      Anna Andreadi     West   M   33
1        Chuck Magee     East   M   45
2     Kelly Williams  Central   F   33
3  Cassandra Brandow    South   F   55

In [23]:
tb1.index

RangeIndex(start=0, stop=4, step=1)

Index can be string and may be unique

In [24]:
tb1.set_index('Age')

                Person   Region Sex
Age
33       Anna Andreadi     West   M
45         Chuck Magee     East   M
33      Kelly Williams  Central   F
55   Cassandra Brandow    South   F

In [26]:
tb1.set_index('Age', inplace=True)
tb1

                Person   Region Sex
Age
33       Anna Andreadi     West   M
45         Chuck Magee     East   M
33      Kelly Williams  Central   F
55   Cassandra Brandow    South   F

In [27]:
tb1.reset_index()

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F

In [28]:
tb1.reset_index(inplace=True)
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F

In [29]:
#lock[row/index,column/name]
tb1.loc[1,'Person']

'Chuck Magee'

In [30]:
tb1.iloc[1,1]

'Chuck Magee'

In [31]:
tb1.loc[1:3,'Person':'Sex']  #tb1.loc[[1:3],['Person':'Sex']] SyntaxError: invalid syntax

              Person   Region Sex
1        Chuck Magee     East   M
2     Kelly Williams  Central   F
3  Cassandra Brandow    South   F

In [32]:
tb1.loc[[1,3],['Person','Sex']]

              Person Sex
1        Chuck Magee   M
3  Cassandra Brandow   F

In [33]:
#tb1.iloc[1:3,1:3]
tb1.iloc[[1,3],[1,3]]

              Person Sex
1        Chuck Magee   M
3  Cassandra Brandow   F

In [34]:
tb2=tb1.head(3)
tb2

   Age          Person   Region Sex
0   33   Anna Andreadi     West   M
1   45     Chuck Magee     East   M
2   33  Kelly Williams  Central   F

In [35]:
tb2.set_index('Sex', inplace=True)

In [36]:
tb2.loc['M']

     Age         Person Region
Sex
M     33  Anna Andreadi   West
M     45    Chuck Magee   East

In [37]:
tb2.loc['M',['Person','Age']]

            Person  Age
Sex
M    Anna Andreadi   33
M      Chuck Magee   45

In [38]:
tb2.set_index('Age', inplace=True)
tb2

             Person   Region
Age
33    Anna Andreadi     West
45      Chuck Magee     East
33   Kelly Williams  Central

In [39]:
#tb2.iloc[33] #IndexError Traceback (most recent call last)----> 1 tb2.iloc[33]
tb2.loc[33]

             Person   Region
Age
33    Anna Andreadi     West
33   Kelly Williams  Central

In [40]:
tb2.reset_index(inplace=True)
tb2.loc[1]

Age                45
Person    Chuck Magee
Region           East
Name: 1, dtype: object

In [41]:
tb1.loc[len(tb1)]=[33,"Cesam Brandow","South","F"]
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F
4   33      Cesam Brandow    South   F

In [42]:
pd.crosstab(tb1.Sex, tb1.Age) #comparing two columns

Age  33  45  55
Sex
F     2   0   1
M     1   1   0

In [46]:
pd.crosstab(index=tb1['Sex'], columns=tb1['Age'], values=tb1['Age'], aggfunc='mean' )

Age    33    45    55
Sex
F    33.0   NaN  55.0
M    33.0  45.0   NaN

In [47]:
#compare more than two columns in context of another column. 
tb1.groupby('Sex').sum()

     Age                                        Person             Region
Sex
F    121  Kelly WilliamsCassandra BrandowCesam Brandow  CentralSouthSouth
M     78                      Anna AndreadiChuck Magee           WestEast

In [49]:
#tb1.loc[len(tb1)]=[33,"Cesam Brandow","South","F"]
tb1.drop(index=5, inplace=True) 
tb1

   Age             Person   Region Sex
0   33      Anna Andreadi     West   M
1   45        Chuck Magee     East   M
2   33     Kelly Williams  Central   F
3   55  Cassandra Brandow    South   F
4   33      Cesam Brandow    South   F

In [54]:
(tb1.groupby(['Sex','Region']).sum()).select_dtypes('int')

             Age
Sex Region
F   Central   33
    South     88
M   East      45
    West      33

In [59]:
(tb1.select_dtypes('int')).groupby([tb1['Sex'],tb1['Region']]).mean() #tb1['Sex'] or 'Sex', tb1['Region'] or 'Region'

              Age
Sex Region
F   Central  33.0
    South    44.0
M   East     45.0
    West     33.0